<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'ویژگی :باید پذیرفته شود.',
    'accepted_if' => 'ویژگی : باید زمانی پذیرفته شود که :other :value باشد.',
    'active_url' => 'ویژگی : URL معتبری نیست.',
     'after' => 'ویژگی : باید تاریخی بعد از :date باشد.',
     'after_or_equal' => 'ویژگی : باید تاریخ بعد یا برابر با :date باشد.',
     'alpha' => 'ویژگی : فقط باید دارای حروف باشد.',
     'alpha_dash' => 'ویژگی : فقط باید شامل حروف, اعداد, خط تیره و زیرخط باشد.',
     'alpha_num' => 'ویژگی : فقط باید دارای حروف و اعداد باشد.',
     'array' => 'ویژگی : باید یک آرایه باشد.',
     'ascii' => 'ویژگی : فقط باید دارای کاراکترها و نمادهای الفبای عددی تک بایتی باشد.',
     'before' => 'ویژگی : باید تاریخی قبل از :date باشد.',
     'before_or_equal' => 'ویژگی : باید تاریخ قبل یا برابر با :date باشد.',
     'بین' => [
    'array' => 'ویژگی : باید بین موارد :min و :max باشد.',
    'file' => 'ویژگی : باید بین :min و :max کیلوبایت باشد.',
    'numeric' => 'ویژگی : باید بین :min و :max باشد.',
    'string' => 'ویژگی : باید بین :min و :max کاراکتر باشد.',
],
     'boolean' => 'فیلد :ویژگی باید درست یا نادرست باشد.',
     'confirmed' => 'تأیید ویژگی : مطابقت ندارد.',
     'current_password' => 'گذرواژه نادرست است.',
     'date' => 'ویژگی : تاریخ معتبری نیست.',
     'date_equals' => 'ویژگی : باید تاریخی برابر با :date باشد.',
     'date_format' => 'ویژگی :با قالب :format مطابقت ندارد.',
     'decimal' => 'ویژگی : باید دارای اعشار :اعشاری باشد.',
     'declined' => 'ویژگی : باید رد شود.',
     'declined_if' => 'ویژگی : زمانی که :other :value باشد باید رد شود.',
     'different' => 'ویژگی :و :دیگر باید متفاوت باشند.',
     'digits' => 'ویژگی : باید ارقام :digits باشد.',
     'digits_between' => 'ویژگی : باید بین :min و :max رقم باشد.',
     'dimensions' => 'ویژگی : دارای ابعاد تصویر نامعتبر است.',
     'distinct' => 'فیلد :attribute دارای یک مقدار تکراری است.',
     'doesnt_end_with' => 'ویژگی : ممکن است به یکی از موارد زیر ختم نشود: :values.',
     'doesnt_start_with' => 'ویژگی : ممکن است با یکی از موارد زیر شروع نشود: :values.',
     'email' => 'ویژگی : باید یک آدرس ایمیل معتبر باشد.',
     'ends_with' => 'ویژگی : باید به یکی از موارد زیر ختم شود: :values.',
     'enum' => 'ویژگی :انتخاب شده نامعتبر است.',
     'exists' => 'ویژگی :انتخاب شده نامعتبر است.',
     'file' => 'ویژگی : باید یک فایل باشد.',
     'filled' => 'فیلد :ویژگی باید دارای یک مقدار باشد.',
     'gt' => [
    'array' => 'ویژگی : باید بیش از موارد :value داشته باشد.',
    'file' => 'ویژگی : باید بزرگتر از :value کیلوبایت باشد.',
    'numeric' => 'ویژگی : باید بزرگتر از :value باشد.',
    'string' => 'ویژگی : باید بزرگتر از کاراکترهای :value باشد.',
],
    'gte' => [
        'array' => 'ویژگی : باید موارد :value یا بیشتر داشته باشید.',
        'file' => 'ویژگی : باید بزرگتر یا مساوی با :value کیلوبایت باشد.',
        'numeric' => 'ویژگی : باید بزرگتر یا مساوی با :value باشد.',
        'string' => 'ویژگی : باید بزرگتر یا مساوی با کاراکترهای :value باشد.',
    ],
     'image' => 'ویژگی : باید یک تصویر باشد.',
     'in' => 'ویژگی :انتخاب شده نامعتبر است.',
     'in_array' => 'فیلد :ویژگی در :other وجود ندارد.',
     'integer' => 'ویژگی : باید یک عدد صحیح باشد.',
     'ip' => 'ویژگی : باید یک آدرس IP معتبر باشد.',
     'ipv4' => 'ویژگی : باید یک آدرس IPv4 معتبر باشد.',
     'ipv6' => 'ویژگی : باید یک آدرس IPv6 معتبر باشد.',
     'json' => 'ویژگی : باید یک رشته JSON معتبر باشد.',
     'lowcase' => 'ویژگی : باید با حروف کوچک باشد.',
     'lt' => [
    'array' => 'ویژگی : باید کمتر از موارد :value داشته باشد.',
    'file' => 'ویژگی : باید کمتر از :value کیلوبایت باشد.',
    'numeric' => 'ویژگی : باید کمتر از :value باشد.',
    'string' => 'ویژگی : باید کمتر از کاراکترهای :value باشد.',
],
     'lte' => [
    'array' => 'ویژگی : نباید بیش از آیتم های :value داشته باشد.',
    'file' => 'ویژگی : باید کمتر یا مساوی :value کیلوبایت باشد.',
    'numeric' => 'ویژگی : باید کمتر یا مساوی با :value باشد.',
    'string' => 'ویژگی : باید کمتر یا مساوی با کاراکترهای :value باشد.',
],
     'mac_address' => 'ویژگی : باید یک آدرس MAC معتبر باشد.',
     'حداکثر' => [
    'array' => 'ویژگی : نباید بیش از موارد :max داشته باشد.',
    'file' => 'ویژگی : نباید بیشتر از :max کیلوبایت باشد.',
    'numeric' => 'ویژگی : نباید بزرگتر از :max باشد.',
    'string' => 'ویژگی : نباید بیشتر از :max کاراکتر باشد.',
],
     'max_digits' => 'ویژگی : نباید بیش از رقم :max داشته باشد.',
     'mimes' => 'ویژگی : باید فایلی از نوع: :values باشد.',
     'mimetypes' => 'ویژگی : باید فایلی از نوع: :values باشد.',
     'دقیقه' => [
    'array' => 'ویژگی : باید حداقل موارد :min داشته باشد.',
    'file' => 'ویژگی : باید حداقل :min کیلوبایت باشد.',
    'numeric' => 'ویژگی : باید حداقل :min باشد.',
    'string' => 'ویژگی : باید حداقل کاراکتر :min باشد.',
],
     'min_digits' => 'ویژگی : باید حداقل دارای :min رقم باشد.',
     'missing' => 'فیلد :ویژگی باید وجود نداشته باشد.',
     'missing_if' => 'فیلد :ویژگی باید وجود نداشته باشد وقتی :other :value باشد.',
     'missing_unless' => 'فیلد :ویژگی باید وجود نداشته باشد مگر اینکه :other :value باشد.',
     'missing_with' => 'فیلد :ویژگی باید در صورت وجود :values وجود نداشته باشد.',
     'missing_with_all' => 'فیلد :ویژگی باید زمانی که :values وجود دارد وجود نداشته باشد.',
     'multiple_of' => 'ویژگی : باید مضرب :value باشد.',
     'not_in' => 'ویژگی :انتخاب شده نامعتبر است.',
     'not_regex' => 'قالب :attribute نامعتبر است.',
     'numeric' => 'ویژگی : باید یک عدد باشد.',
     'رمز عبور' => [
    'letters' => 'ویژگی : باید حداقل یک حرف داشته باشد.',
    'mixed' => 'ویژگی : باید حداقل یک حرف بزرگ و یک حرف کوچک داشته باشد.',
    'numbers' => 'ویژگی : باید حداقل یک عدد داشته باشد.',
    'symbols' => 'ویژگی : باید حداقل دارای یک نماد باشد.',
    'uncompromised' => 'ویژگی :در یک نشت داده ظاهر شده است. لطفاً یک :ویژگی متفاوت را انتخاب کنید.',
     ],
     'present' => 'فیلد :ویژگی باید وجود داشته باشد.',
     'prohibited' => 'فیلد :ویژگی ممنوع است.',
     'prohibited_if' => 'فیلد :ویژگی زمانی که :other :value باشد ممنوع است.',
     'prohibited_unless' => 'فیلد :attribute ممنوع است مگر اینکه :other در :values باشد.',
     'prohibits' => 'فیلد :ویژگی وجود :other را ممنوع می کند.',
     'regex' => 'قالب :attribute نامعتبر است.',
     'required' => 'فیلد :ویژگی الزامی است.',
     'required_array_keys' => 'فیلد :ویژگی باید حاوی ورودی هایی برای: :values باشد.',
     'required_if' => 'فیلد :ویژگی زمانی لازم است که :other :value باشد.',
     'required_if_accepted' => 'فیلد :ویژگی زمانی لازم است که :other پذیرفته شود.',
     'required_unless' => 'فیلد :ویژگی الزامی است مگر اینکه :other در :values باشد.',
     'required_with' => 'فیلد :ویژگی زمانی لازم است که :values وجود داشته باشد.',
     'required_with_all' => 'فیلد :ویژگی زمانی لازم است که :values وجود داشته باشد.',
     'required_without' => 'فیلد :ویژگی زمانی لازم است که :values وجود نداشته باشد.',
     'required_without_all' => 'فیلد :ویژگی زمانی لازم است که هیچ یک از :value ها وجود نداشته باشد.',
     'same' => 'ویژگی :و :دیگر باید مطابقت داشته باشند.',
    'اندازه' => [
        'array' => 'ویژگی : باید شامل موارد :size باشد.',
        'file' => 'ویژگی :باید :size کیلوبایت باشد.',
        'numeric' => 'ویژگی : باید :size باشد.',
        'string' => 'ویژگی : باید کاراکترهای :size باشد.',
    ],
     'starts_with' => 'ویژگی : باید با یکی از موارد زیر شروع شود: :values.',
     'string' => 'ویژگی : باید یک رشته باشد.',
     'timezone' => 'ویژگی : باید یک منطقه زمانی معتبر باشد.',
     'unique' => 'ویژگی : قبلاً گرفته شده است.',
     'uploaded' => 'ویژگی : بارگذاری نشد.',
     'uppercase' => 'ویژگی : باید با حروف بزرگ باشد.',
     'url' => 'ویژگی : باید یک URL معتبر باشد.',
     'ulid' => 'ویژگی : باید یک ULID معتبر باشد.',
     'uuid' => 'ویژگی : باید یک UUID معتبر باشد.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
